export const ORDER_STATUS = {
  "-1": {
    text: "审批中",
    subtext: () => "审批通过后将为您派车",
  },
  1: {
    text: "派单中.",
    subtext: () => "",
  }, // 待派车
  0: {
    text: "司机已接单",
    subtext: (p) => `当前接单平台为${p}，请耐心等待司机接驾`,
  }, // (预约单，未开始执行订单)
  2: {
    text: "司机已出发",
    subtext: (p) => `当前接单平台为${p}，请耐心等待司机接驾`,
  }, // 已派车(接驾中)
  3: {
    text: "司机已到达",
    subtext: () => "",
  }, // 待上车(到达上车点)
  4: {
    text: "正在前往目的地",
    subtext: () => "司机正在为您服务，如有问题可联系客服",
  }, // (乘客上车，开始计费，送驾中)
  5: {
    text: "行程已完成",
    subtext: (p) => `${p}提供本次服务`,
  }, // 行程结束(费用确认中)
  6: {
    text: "待支付",
    subtext: () => "费用确认中",
  }, // (费用确认)
  100: {
    text: "已支付",
    subtext: () => "",
  }, // (已支付)
  101: {
    text: "订单超时",
    subtext: () => "",
  },
  102: {
    text: "订单取消",
    subtext: () => "",
  },
};
